wdi_restful_dictionary/app/views/entries/index.html.erb

SELECT "entries".* FROM "entries" ORDER BY "entries"."word" DESC
---

<% Entry.all.order(word: :asc).each do |entry| %>