clubz/app/controllers/clubs_controller.rb

  def index
    @clubs = Club.all
---
SELECT "clubs".* FROM "clubs"

  def show
    @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @club = Club.new(
      name: params[:club][:name],
      description: params[:club][:description],
      user: current_user
    )

    if @club.save
---
INSERT INTO "clubs" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"