clubz/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Magus"], ["password_digest", "$2a$10$AC3uMcwEVF8buJdeU1iYnu3J4ZyKy.EH5VD7W0g4s9K2jlTaCyjQ."], ["created_at", 2017-11-30 15:21:28 UTC], ["updated_at", 2017-11-30 15:21:28 UTC]]
---
  def create
    @user = User.new(
      name:                  params[:user][:name],
      password:              params[:user][:password],
      password_confirmation: params[:user][:password_confirmation],
      role:                  params[:user][:role].downcase
    )

    if @user.save