photogur/app/controllers/pictures_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def load_picture
    @picture = Picture.find(params[:id])

UPDATE "pictures" SET "created_at" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["created_at", 2016-11-20 19:59:33 UTC], ["updated_at", 2017-11-25 20:16:12 UTC], ["id", 1]]
---
  def update
    @picture = Picture.find(params[:id])

    @picture.title  = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url    = params[:picture][:url]

    if @picture.save

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["artist", "James Neilson"], ["title", "Crazy Photo"], ["url", "https://picsum.photos/500/300"], ["created_at", 2017-12-01 17:54:05 UTC], ["updated_at", 2017-12-01 17:54:05 UTC], ["user_id", 2]]
---
  def create
    @picture = Picture.new

    @picture.title  = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url    = params[:picture][:url]
    @picture.user   = current_user

    if @picture.save

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 4]]
---
  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy