wdi_restful_dictionary/app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entries = Entry.all

INSERT INTO "entries" ("word", "definition", "language", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["word", "Stoccato"], ["definition", "When the notes played are short and sharp."], ["language", "en"], ["created_at", "2017-11-24 00:04:39.846756"], ["updated_at", "2017-11-24 00:04:39.846756"]]
---
  def create
    @entry = Entry.new
    @entry.word = params[:entry][:word].downcase
    @entry.definition = params[:entry][:definition]
    @entry.language = params[:entry][:language]

    if @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @entry = Entry.find(params[:id])

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @entry = Entry.find(params[:id])

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "entries" SET "word" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["word", "absolute musi"], ["updated_at", "2017-11-24 00:21:43.811001"], ["id", 1]]
---
  def update
    @entry = Entry.find(params[:id])
    @entry.word = params[:entry][:word].to_s.downcase
    # @entry.word = @entry.word.downcase!
    @entry.definition = params[:entry][:definition]
    @entry.language = params[:entry][:language]

    if @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 72]]
---
  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy